package com.repository.crm.constant;

/**
 * 业务日志，操作模块枚举
 * @author csy
 * @date 2017年12月18日 下午3:09:56
 */
public enum OperationModule {
	/* 我的学生 **/
    CC_CR_100001(100001,"我的学生"),
    /* 待跟进 **/
    CC_CR_100002(100002,"待跟进"),
    /* 待排课 **/
    CC_CR_100003(100003,"待排课"),
    /* 待跟进 **/
    CC_CR_100004(100004,"待跟进"),
    /* 待反馈 **/
    CC_CR_100005(100005,"待反馈"),
    /* 待付费 **/
    CC_CR_100006(100006,"待付费"),
    /* 待排第一节正式课 **/
    CC_CR_100007(100007,"待排第一节正式课"),
    /* 待移交正式生 **/
    CC_CR_100008(100008,"待移交正式生"),
    /* 新名单分配 **/
    CC_CR_100009(100009,"新名单分配"),
    /* 正式生分配 **/
    CC_CR_100010(100010,"正式生分配"),
    /* 藏金阁分配 **/
    CC_CR_100011(100011,"藏金阁分配 "),
    /* 回收站分配 **/
    CC_CR_100012(100011,"回收站分配 "),
    /* 待排课程 **/
    TC_101001(101001,"待排课程"),
    /* 已排课程 **/
    TC_101002(101002,"已排课程"),
    /* 资源管理 **/
    RULE_101001(101001,"资源管理"),
    /* 角色管理 **/
    RULE_102002(102002,"角色管理"),
    /* 用户管理 **/
    RULE_102003(102003,"用户管理"),
    /* 部门管理 **/
    RULE_102004(102004,"部门管理"),
    /* 团队 **/
    RULE_102005(102005,"团队"),
    /* 职位 **/
    RULE_102006(102006,"职位"),
    /* 渠道 **/
    MD_103000(103000,"渠道"),
    /* 渠道投放 **/
    MD_103001(103001,"渠道投放"),
    /* 渠道类别 **/
    MD_103002(103002,"渠道类别"),
    /* 新增leads **/
    MD_103003(103003,"新增leads"),
    /* 新增leads **/
    MD_103004(103004,"新增推荐leads"),
    /* 推广渠道 **/
    MD_103005(103005,"推广渠道"),
    /* 用户登录 **/
    USER_104001(104001," 用户登录"),
    /* 招师代理 **/
    TC_AGENT_105001(105001,"招师代理"),
	/* 招师-待面试 **/
    TC_TEACHER_106001(106001,"招师-待面试"),
    /* 招师-待培训 **/
    TC_TEACHER_106002(106002,"招师-待培训"),
    /* 招师-待完善资料 **/
    TC_TEACHER_106003(106003,"招师-待完善资料"),
    /* 招师-待二次培训 **/
    TC_TEACHER_106004(106004,"招师-待二次培训"),
    /* 招师-新增老师 **/
    TC_TEACHER_106005(106005,"招师-新增老师"),
    /* 招师-完善资料 **/
    TC_TEACHER_106006(106006,"招师-完善资料"),
    /* 招师-待邀约 **/
    TC_TEACHER_106007(106007,"招师-待邀约"),
    /* 招师代理 **/
    TC_AGENT_108001(108001,"招师代理"),
    /* 招师代理-级别薪资管理 **/
    TC_AGENT_108002(108002,"招师代理-级别薪资管理"),
    /* 代理系统**/
    TC_AGENT_109001(109001,"代理系统"),
    /* 电话号码  **/
	PH_PHONE_107001(107001,"电话号码管理"),
	/*密码**/
	PSD_110001(110001,"密码管理"),	
	 /* 师资管理-讲师库  **/
	TC_MANAGE_111001(111001,"师资管理-讲师库"),
	 /* 师资管理-可排课老师  **/
	TC_MANAGE_111002(111002,"师资管理-可排课老师"),
	/* 师资管理-回收站  **/
	TC_MANAGE_111003(111003,"师资管理-回收站"),
	 /* 师资管理-新增老师  **/
	TC_MANAGE_111004(111004,"师资管理-新增老师"),
	 /* 师资管理-邮件发送  **/
	TC_MANAGE_111005(111005,"师资管理-发送邮件"),
	 /* 师资管理-课程课耗-全职  **/
	TC_MANAGE_111006(111006,"师资管理-课程课耗-全职"),
	 /* 师资管理-课程课耗-兼职  **/
	TC_MANAGE_111007(111007,"师资管理-课程课耗-兼职"),
	 /* 师资管理-师资管理-老师更换手机号  **/
	TC_MANAGE_111008(111008,"师资管理-老师更换手机号"),
	 /* 数据报表-老师记录  **/
	KPI_112001(112001,"数据报表-老师报名列表"),
	/* 数据报表-监课  **/
	KPI_112002(112002,"数据报表-监课"),
	/* 数据报表-已经安排培训列表  **/
	KPI_112003(112003,"数据报表-已经安排培训列表"),
	/* 定时任务 **/
	TIMED_TASK_113001(113001,"定时任务"),
	/* 薪资管理-等级时薪管理 **/
	PAY_MANAGE_114001(114001,"薪资管理-等级时薪管理"),
	/* 微信-师资-登录 **/
	WECHAT_TC_BINDING_115001(115001,"微信-师资-登录"),	
	/* 微信-师资-调整空闲时间 **/
	WECHAT_TC_DATE_115002(115002,"微信-师资-调整空闲时间"),
	/* 微信-师资-调整排课状态 **/
	WECHAT_TC_STATUS_115003(115003,"微信-师资-调整排课状态"),
	/* 微信-师资-课表 **/
	WECHAT_TC_COURSE_115004(115004,"微信-师资-课表"),
	/* 微信-招师代理-登录 **/
	WECHAT_AGENT_BINDING_116001(116001,"微信-招师代理-登录"),
	/* 全职老师-待培训 **/
	FULL_TIME_TEACHER_117001(117001,"全职老师-待培训"),
	/* 离职leads **/
	DIMISSION_SALE_LEADS_118001(118001,"离职leads"),
	/* 离职正式生 **/
	DIMISSION_SALE_STUDENT_118002(118002,"离职正式生"),
	/* 开课 **/
	CREATE_COURSE_119001(119001,"排课"),
	 /* 学生详情 **/
    LEADS_OR_STUDENT_INFO_102003(120001,"学生leads详情"),
	 /* 本团队正式生分配**/
    TEAM_DISTRIBUTION_STUDENT(121001,"本团队正式生分配"),
	 /* 正式生排课表 **/
    FORMAL_COURSE(121001,"正式生排课表"),
	 /* 正式生再分配 **/
    STUDENT_AGAIN_DISTRIBUTION(122001,"正式生再分配"),
	 /* 待审核子单 **/
    WAIT_CHECK_CHILD_ORDER(123001,"待审核子单"),
	 /* 待审核订单 **/
    WAIT_CHECK_ORDER(123001,"待审核订单"),
	 /* 课时包 **/
    COURSE_PRICE_124001(124001,"课时包管理"),
	 /* 个性测评 **/
    LEADS_ASSESSMENT_125001(125001,"个性测评"),
	 /* 优惠码 **/
    PROMOTION_CODE_126001(126001,"优惠码管理"),
	 /* 新正式生分配 **/
    NEW_STUDENT_DISTRIBUTION_127001(127001,"新正式生分配"),
	 /* 已排課程 **/
    HAVE_COURSE_128001(128001,"已排课程"),
	 /* 待排课程 **/
    WAIT_COURSE_129001(129001,"待排课程"),
	 /* 天润 **/
    TR_130001(130001,"天润"),
    /* 课程管理 **/
    COURSE_MANAGEMENT(140001,"课程管理"),
    /* 课程管理-测评课取消审核**/
    ASSESSMENT_COURSE_APPROVAL(150001,"测评课取消审核"),
    /* 课程管理-正式课调整 **/
    FORMAL_COURSE_ADJUSTMENT(160001,"正式课调整"),
    /* 课程管理-课程审核历史 **/
    COURSE_AUDIT_RECORDS(170001,"课程审核历史"),
	 /* 工单系统 **/
    WORK_FLOW_180001(180001,"工单系统"),
	 /* 业务日志-调试课信息 **/
    DEBUG_COURSE_190001(190001,"调试课信息"),
	 /*客户端管理-版本管理 **/
    CLIENT_MANAGE_200001(200001,"版本管理"),
	 /*客户端管理-下载统计 **/
    CLIENT_DOWNLOAD_COUNT_210001(210001,"下载统计"),
	 /*天润外呼记录-下载统计 **/
    TR_OUT_BOUND_230001(230001,"天润外呼记录"),
    /*重复报名leads分配**/
    REPEAT_SIGN_UP_LEADS_220001(220001,"重复报名leads分配"),
    /*课时管理**/
    COURSE_CONSUME_220002(220002,"编辑课时消耗"),
    /*课程管理**/
    COURSE_ADJUSTMENT_220003(220003,"调整课程"),

    /* 师资管理-老师空闲时间  **/
    TC_DATE_111009(111009,"师资管理-老师空闲时间"),
    /** 招师-分配老师  **/
   	TC_TEACHER_106008(106008,"招师-分配老师"),
    /** 招师-老师面试安排  **/
   	TC_TEACHER_106009(106009,"招师-老师面试安排"),
	 /** 教研-课件管理  **/
   	COURSEWARE_MANAGE_240001(240001,"教研-课件管理"),   	
    /***  数据报表-销售业绩明细  */
   	SALE_TARGET_250001(250001,"数据报表-销售业绩明细"),   	
    /***  财务-线下已审核业绩  */
   	FN_AUDITED_260001(260001,"财务-线下已审核业绩"),
    /***  数据报表-销售部KPI  */
   	SALE_KPI_270001(270001,"数据报表-销售部KPI"),
    /*** 财务-线下业绩统计 */
   	FN_OFFLINE_260001(260002,"财务-线下业绩统计"),
    /*** 数据报表-排课数据 */
   	ARRANGE_COURSE_250002(250002,"数据报表-排课数据"),
   	/** 推荐Leads数据 */
   	RECOMMEND_LEADS_250003(250003,"数据报表-推荐Leads数据"),
	/** 指标管理-业绩指标管理 */
   	TEAM_SALE_TARGET_280001(280001,"指标管理-业绩指标管理"),
   	/** 指标管理-销售月指标分解 */
   	SALE_TARGET_280002(280002,"指标管理-销售月指标分解"),
	/** 市场-兑换码管理 */
   	PROD_COUPON_CODE_290001(290001,"市场-兑换码管理"),
   	/** 权限管理-正式生修改手机号 */
   	UPDATE_PHONE_300001(300001,"权限管理-正式生修改手机号"),
   	/** 师资管理-离职库 */
   	LEAVE_TEACHER_111010(111010,"师资管理-离职库");
	
    OperationModule(Integer value,String name){
		this.name = name;
		this.value = value;
	}
	private String name;
	private Integer value;
	
	public Integer getValue() {
		return value;
	}
	public String getName() {
		return name;
	}
	
}
